Revit 2027 API
Edge.TessellateOnFace Method
Returns a polyline approximation to the edge in UV parameters of the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<UV> TessellateOnFace(
	Face face
)
Public Function TessellateOnFace (
	face As Face
) As IList(Of UV)
public:
IList<UV^>^ TessellateOnFace(
	Face^ face
)
member TessellateOnFace :
        face : Face -> IList<UV>
Parameters
face Face
The face on which to perform the tessellation. Must belong to the edge.
Return Value
IList<UV>
Remarks
Tolerance of approximation is defined internally by Revit to be adequate for display purposes.
See Also
Reference
Edge Class
Autodesk.Revit.DB Namespace